# PrintToFileName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..PrintToFileName Property
PrintManager Class See Also
---
The file name when printing to file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string PrintToFileName { get; set; }
```

Visual Basic
---
```text
Public Property PrintToFileName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ PrintToFileName {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
A default file name will be used when the PrintToFile is true and PrintToFileName is not be set.
The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input file name is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the input file name is an invalid string. |

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace